import os
import platform
import xml.etree.ElementTree as ET

from sources import sourcemap
from sources import utilities
from colorama import Fore, Style, init

## Variables

opcion_choosed = 0
system = platform.system()

## Functions

def clear_console():
    if platform.system() == "Windows":
        os.system("cls")
    else:  # Linux y macOS
        os.system("clear")

def main_cycle_option():
    clear_console()
    print(f"""{Fore.MAGENTA}
        ###############################################################################
        #                                                                             #
        #  █████████     ███████   █████████  ███         ███████    ███         ███  #
        #  ███     ███ ███     ███ ███    ███ ███       ███     ███    ███     ███    #
        #  ███     ███ ███     ███ █████████  ███       ███     ███      ███ ███      #
        #  █████████   ███     ███ ███    ███ ███       ███     ███       █████       #
        #  ███     ███ ███     ███ ███    ███ ███       ███     ███    ███     ███    #
        #  ███     ███   ███████    ████████  █████████   ███████    ███         ███  #
        #                                                                             #
        #                        ███████████   █████                                  #
        #                            ███     ███   ███                                #
        #                            ███     ███   ███                                #
        #                            ███     ███   ███                                #   
        #                            ███       █████                                  #
        #                                                                             #
        #    ██████       ████████   █████████     ████████   ███████████████         #
        #  ███     ███  ███      ███ ███     ███ ███      ███       ███               #
        #  ███          ███      ███ ███     ███ ███      ███       ███               #
        #  ███          ███      ███ ███     ███ ███      ███       ███               #
        #  ███   █████  ███      ███ ███     ███ ███      ███       ███               #
        #  ███      ███ ███      ███ ███     ███ ███      ███       ███               #
        #    ████████     ████████   █████████     ████████         ███               #
        #                                                                             #    
        #                                                                             #                                                            
        #                                                                             #    
        ###############################################################################
                              Created by DevEdugamen  ({utilities.get_version()})              
            

    {Fore.RESET}""")

    print("Small program converting roblox place to a godot project semi-completly")

## Main


main_cycle_option()
utilities.get_version()


# print("[1] - Choose the file .rbxlx ")
# search_file()

# print("\n\n[2] - Insert a name for the project")
# main_project_name = str(input("Project Name: "))